; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 495638 2 2 4 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	spectrograph1 - mode
	infrared3 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star7 - direction
	Star6 - direction
	Star1 - direction
	GroundStation5 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star6)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(pointing satellite1 Phenomenon11)
	(have_image Phenomenon8 infrared3)
	(have_image Star9 thermograph2)
	(have_image Star10 spectrograph1)
	(have_image Phenomenon11 infrared3)
	(have_image Planet12 thermograph2)
	(have_image Planet13 infrared3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (turn_to satellite0 star1 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star1)
   goals met: 0 of 7
4. (turn_to satellite1 groundstation5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 7
5. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 7
6. (calibrate satellite1 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 0 of 7
7. (turn_to satellite0 star9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
8. (turn_to satellite1 planet13 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet13)
   goals met: 0 of 7
9. (take_image satellite0 star9 instrument1 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 1 of 7
10. (take_image satellite1 planet13 instrument2 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 2 of 7
11. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 2 of 7
12. (turn_to satellite1 phenomenon11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 7
13. (take_image satellite0 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 4 of 7
14. (take_image satellite1 phenomenon11 instrument2 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 5 of 7
15. (turn_to satellite0 planet12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet12)
   goals met: 5 of 7
16. (turn_to satellite1 phenomenon8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 7
17. (take_image satellite0 planet12 instrument1 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 5 of 7
18. (take_image satellite1 phenomenon8 instrument2 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 6 of 7
19. (turn_to satellite1 phenomenon11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon11)
   goals met: 7 of 7
